; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-4)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 9884)
	(= (fuel plane1) 1957)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 10)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 8)
	(at plane2 city1)
	(= (capacity plane2) 10974)
	(= (fuel plane2) 3394)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 15)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 5)
	(at person1 city2)
	(at person2 city2)
	(at person3 city1)
	(at person4 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 596)
	(= (distance city0 city2) 600)
	(= (distance city0 city3) 812)
	(= (distance city1 city0) 596)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 792)
	(= (distance city1 city3) 924)
	(= (distance city2 city0) 600)
	(= (distance city2 city1) 792)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 560)
	(= (distance city3 city0) 812)
	(= (distance city3 city1) 924)
	(= (distance city3 city2) 560)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city0)
	(at person1 city2)
	(at person2 city3)
	(at person3 city2)
	(at person4 city3)
	))

(:metric minimize (+ (* 3 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (refuel plane1 city1)
   changed: (fuel plane1) from 1957 to 9884
   goals met: 1 of 5
2. (board person3 plane1 city1)
   deleted: (at person3 city1)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 5
3. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 2384, (fuel plane1) from 9884 to 7500
   goals met: 2 of 5
4. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 2384 to 4784, (fuel plane1) from 7500 to 5100
   goals met: 1 of 5
5. (debark person3 plane1 city2)
   deleted: (in person3 plane1)
   added: (at person3 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 5
6. (board person2 plane1 city2)
   deleted: (at person2 city2)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 5
7. (board person4 plane1 city2)
   deleted: (at person4 city2)
   added: (in person4 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 5
8. (fly plane1 city2 city3)
   deleted: (at plane1 city2)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 4784 to 7024, (fuel plane1) from 5100 to 2860
   goals met: 2 of 5
9. (refuel plane1 city3)
   changed: (fuel plane1) from 2860 to 9884
   goals met: 2 of 5
10. (debark person2 plane1 city3)
   deleted: (in person2 plane1)
   added: (at person2 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 3 of 5
11. (debark person4 plane1 city3)
   deleted: (in person4 plane1)
   added: (at person4 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 5
12. (zoom plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 7024 to 15144, (fuel plane1) from 9884 to 1764
   goals met: 5 of 5
